public/man/man1/bluetoothctl-gatt.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - bluetoothctl-gatt.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - bluetoothctl-gatt.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>bluetoothctl-gatt - Generic Attribute Submenu</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>bluetoothctl</strong> [–options] [gatt.commands]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
GENERIC ATTRIBUTE COMMANDS
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
list-attributes
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>List attributes.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># list-attributes &lt;attribute/UUID&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
select-attribute
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Select attribute.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># select-attribute &lt;attribute/UUID&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
attribute-info
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Select attribute.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># attribute-info [attribute/UUID]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
read
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>Read attribute value.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># read [offset]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
write
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>Write attribute value.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># write &lt;data=xx xx …&gt; [offset] [type]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
acquire-write
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>Acquire Write file descriptor.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># acquire-write</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
release-write
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>Release Write file descriptor.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># release-write</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
acquire-notify
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>Acquire Notify file descriptor.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># acquire-notify</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
release-notify
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>Release Notify file descriptor.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># release-notify</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
notify
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<p>Notify attribute value.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># notify &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
clone
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p>Clone a device or attribute.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># clone [dev/attribute/UUID]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
register-application
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p>Register application.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># register-application [UUID …]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
unregister-application
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<p>Unregister application</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># unregister-application</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-17" class="outline-3">
<h3 id="headline-17">
register-service
</h3>
<div id="outline-text-headline-17" class="outline-text-3">
<p>Register application service.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># register-service &lt;UUID&gt; [handle]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-18" class="outline-3">
<h3 id="headline-18">
unregister-service
</h3>
<div id="outline-text-headline-18" class="outline-text-3">
<p>Unregister application service</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># unregister-service &lt;UUID/object&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-19" class="outline-3">
<h3 id="headline-19">
register-includes
</h3>
<div id="outline-text-headline-19" class="outline-text-3">
<p>Register as Included service.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong>#r egister-includes &lt;UUID&gt; [handle]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-20" class="outline-3">
<h3 id="headline-20">
unregister-includes
</h3>
<div id="outline-text-headline-20" class="outline-text-3">
<p>Unregister Included service.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># unregister-includes &lt;Service-UUID&gt;&lt;Inc-UUID&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-21" class="outline-3">
<h3 id="headline-21">
register-characteristic
</h3>
<div id="outline-text-headline-21" class="outline-text-3">
<p>Register service characteristic.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># register-characteristic &lt;UUID&gt;
&lt;Flags=read,write,notify…&gt; [handle]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-22" class="outline-3">
<h3 id="headline-22">
unregister-characteristic
</h3>
<div id="outline-text-headline-22" class="outline-text-3">
<p>Unregister service characteristic.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># unregister-characteristic &lt;UUID/object&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-23" class="outline-3">
<h3 id="headline-23">
register-descriptor
</h3>
<div id="outline-text-headline-23" class="outline-text-3">
<p>Register characteristic descriptor.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># register-descriptor &lt;UUID&gt; &lt;Flags=read,write…&gt;
[handle]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-24" class="outline-3">
<h3 id="headline-24">
unregister-descriptor
</h3>
<div id="outline-text-headline-24" class="outline-text-3">
<p>Unregister characteristic descriptor.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># unregister-descriptor &lt;UUID/object&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-25" class="outline-2">
<h2 id="headline-25">
RESOURCES
</h2>
<div id="outline-text-headline-25" class="outline-text-2">
<p>&lt;http://www.bluez.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-26" class="outline-2">
<h2 id="headline-26">
REPORTING BUGS
</h2>
<div id="outline-text-headline-26" class="outline-text-2">
<p>&lt;linux-bluetooth@vger.kernel.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-27" class="outline-2">
<h2 id="headline-27">
COPYRIGHT
</h2>
<div id="outline-text-headline-27" class="outline-text-2">
<p>Free use of this software is granted under ther terms of the GNU Lesser
General Public Licenses (LGPL).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
